In [ ]:
# Business Analytics Assignment – 2

## Dataset Description

Dataset Name: Retail Sales Dataset  
Source: GitHub (public repository)

Each row in this dataset represents a single sales transaction, including
order details, product, region, quantity, price, and revenue.

In [4]:
import pandas as pd
import numpy as np

In [5]:


df = pd.read_csv(r"C:\Users\pooji\Downloads\sales_data.csv") 
df

       order_id        date region     product  quantity  unit_price  revenue
0          1000  2024-01-01  South      Laptop         1     1170.68  1170.68
1          1000  2024-01-01  South       Mouse         3       25.41    76.23
2          1001  2024-01-01  South       Mouse         4       24.59    98.36
3          1002  2024-01-01  South      Tablet         4      455.91  1823.64
4          1003  2024-01-01  North  Headphones         1       81.23    81.23
...         ...         ...    ...         ...       ...         ...      ...
18054      9976  2024-12-30   East  Smartphone         3      865.41  2596.23
18055      9976  2024-12-30   East       Mouse         3       23.31    69.93
18056      9976  2024-12-30   East        Desk         1      203.90   203.90
18057      9977  2024-12-30   West      Laptop         3     1050.87  3152.61
18058      9978  2024-12-30   West    Keyboard         1       43.82    43.82

[18059 rows x 7 columns]

In [6]:
df.shape

(18059, 7)

In [7]:
df.head()

   order_id        date region     product  quantity  unit_price  revenue
0      1000  2024-01-01  South      Laptop         1     1170.68  1170.68
1      1000  2024-01-01  South       Mouse         3       25.41    76.23
2      1001  2024-01-01  South       Mouse         4       24.59    98.36
3      1002  2024-01-01  South      Tablet         4      455.91  1823.64
4      1003  2024-01-01  North  Headphones         1       81.23    81.23

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18059 entries, 0 to 18058
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order_id    18059 non-null  int64
 1   date        18059 non-null  object
 2   region      18059 non-null  object
 3   product     18059 non-null  object
 4   quantity    18059 non-null  int64
 5   unit_price  18059 non-null  float64
 6   revenue     18059 non-null  float64
dtypes: float64(2), int64(2), object(3)
memory usage: 987.7+ KB

In [9]:
df.isnull().sum()

order_id      0
date          0
region        0
product       0
quantity      0
unit_price    0
revenue       0
dtype: int64

In [10]:
df.isnull().sum()

order_id      0
date          0
region        0
product       0
quantity      0
unit_price    0
revenue       0
dtype: int64

In [11]:
df['date'] = pd.to_datetime(df['date'])

In [12]:
df['quantity'] = df['quantity'].fillna(df['quantity'].mean())

In [13]:
df['region'] = df['region'].fillna(df['region'].mode()[0])

In [14]:
df = df.drop_duplicates()

In [15]:
df['product'] = df['product'].str.strip()

In [16]:
df['product'] = df['product'].str.title()

In [17]:
df['total_sales'] = df['quantity'] * df['unit_price']

In [18]:
df['sales_type'] = df['total_sales'].apply(
    lambda x: 'High Value' if x > 500 else 'Low Value')

In [19]:
df['order_year'] = df['date'].dt.year

In [20]:
df.groupby('region')['total_sales'].agg(['sum', 'mean'])

               sum        mean
region
East    3595279.81  810.295202
North   3808908.00  817.186870
South   3454678.67  791.087399
West    3863611.34  841.012481

In [21]:
df.sort_values(by='total_sales', ascending=False).head(5)

,order_id,date,region,product,quantity,unit_price,revenue,total_sales,sales_type,order_year
11892,6871,2024-08-27,West,Laptop,4,1209.94,4839.76,4839.76,High Value,2024
13301,7560,2024-09-22,North,Laptop,4,1209.36,4837.44,4837.44,High Value,2024
10234,6055,2024-07-24,South,Laptop,4,1208.70,4834.80,4834.80,High Value,2024
675,1339,2024-01-16,North,Laptop,4,1208.27,4833.08,4833.08,High Value,2024
1405,1696,2024-01-28,West,Laptop,4,1207.31,4829.24,4829.24,High Value,2024

In [22]:
df['product'].value_counts()

product
Desk          1873
Printer       1853
Monitor       1824
Laptop        1810
Chair         1806
Tablet        1793
Keyboard      1790
Smartphone    1776
Mouse         1767
Headphones    1767
Name: count, dtype: int64

In [23]:
pd.pivot_table(
    df,
    values='total_sales',
    index='region',
    columns='order_year',
    aggfunc='sum'
)

order_year        2024
region
East        3595279.81
North       3808908.00
South       3454678.67
West        3863611.34

In [24]:
df[df['total_sales'] < 100]

,order_id,date,region,product,quantity,unit_price,revenue,total_sales,sales_type,order_year
1,1000,2024-01-01,South,Mouse,3,25.41,76.23,76.23,Low Value,2024
2,1001,2024-01-01,South,Mouse,4,24.59,98.36,98.36,Low Value,2024
4,1003,2024-01-01,North,Headphones,1,81.23,81.23,81.23,Low Value,2024
14,1009,2024-01-01,West,Mouse,1,25.06,25.06,25.06,Low Value,2024
16,1010,2024-01-01,South,Mouse,3,24.20,72.60,72.60,Low Value,2024
...,...,...,...,...,...,...,...,...,...,...
18032,9963,2024-12-30,West,Keyboard,2,48.23,96.46,96.46,Low Value,2024
18043,9969,2024-12-30,West,Mouse,4,23.26,93.04,93.04,Low Value,2024
18046,9972,2024-12-30,West,Keyboard,2,42.27,84.54,84.54,Low Value,2024
18055,9976,2024-12-30,East,Mouse,3,23.31,69.93,69.93,Low Value,2024
18058,9978,2024-12-30,West,Keyboard,1,43.82,43.82,43.82,Low Value,2024